// todo                              Check the exam

//* Первый входной массив - это ключ к правильным ответам на экзамен,
//*    например["a", "a", "b", "d"].Второй массив содержит представленные ответы студента.

//* Два массива не являются пустыми и имеют одинаковую длину.Верните оценку для этого 
//* массива ответов, указав + 4 за каждый правильный ответ, -1 за каждый неправильный
//*  ответ и + 0 за каждый пустой ответ, представленный в виде пустой
//* строки(в C используется пробел).

//* Если результат < 0, верните 0.

//* Например:

//* checkExam(["a", "a", "b", "b"], ["a", "c", "b", "d"]) → 6
//* checkExam(["a", "a", "c", "b"], ["a", "a", "b", ""]) → 7
//* checkExam(["a", "a", "b", "c"], ["a", "a", "b", "c"]) → 16
//* checkExam(["b", "c", "b", "a"], ["", "a", "a", "c"]) → 0

function checkExam(array1, array2) {
   let result = 0
   for (let i = 0; i < array1.length; i++) {

      if (array1[i] === array2[i]) {
         result += 4
      }

      if (array1[i] != array2[i] && array2[i] != '') {
         result -= 1
      }
   }
   return result > 0 ? result : 0
}

console.log(checkExam(["b", "c", "b", "a"], ["", "a", "a", "c"]));
console.log(checkExam(["a", "a", "b", "b"], ["a", "c", "b", "d"]));